# Создайте новый класс Buiding с атрибутом total
# Создайте инициализатор для класса Buiding, который будет увеличивать
# атрибут количества созданных объектов класса Building total
# В цикле создайте 40 объектов класса Building и выведите их на экран командой print


class building:
    total = 0

    def __init__(self):
       obj_list = []
       while total < 40:
            obj_list.append(i)
            obj_list[i] = building()
            total += 1
       print(obj_list)